<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Kelvin.</string>
	<key>Identifier</key>
	<string>de.schoeM.download.Kelvin</string>
	
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kelvin</string>
	</dict>
	
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	
	
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://creativeforce.io</string>
                <key>re_pattern</key>
                <string>https://download.creativeforce.io/released-files.3x/prod/kelvin/mac/Kelvin-(\d(\.\d)+)-mac\.pkg</string>
                <key>re_flags</key>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://download.creativeforce.io/released-files\.3x/prod/kelvin/mac/Kelvin-%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Creativeforce.io, Inc. (Y5K3N5Y6PY)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>	
</dict>
</plist>
