<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group. This recipe is shamelessly stolen from Graham Pugh and modified by @schoeM</string>
	<key>Identifier</key>
	<string>de.schoeM.Jamf.MSEdge</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Browser</string>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>%NAME% Version</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>ExtensionAttribute-CFBundleVersion.sh</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>JamfSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Microsoft Edge</string>
		<key>POLICY_CATEGORY</key>
		<string>Browser</string>
		<key>POLICY_NAME</key>
		<string>Update %NAME%</string>
		<key>POLICY_TEMPLATE</key>
		<string>JamfAutoUpdate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Edge ist ein schneller, einfacher und sicherer Webbrowser, geschaffen für das moderne Web.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Aktualisiere %NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Testing</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.microsoftedge</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%UPDATE_PREDICATE%</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>ea_name</key>
				<string>%EXTENSION_ATTRIBUTE_NAME%</string>
				<key>ea_script_path</key>
				<string>%EXTENSION_ATTRIBUTE_SCRIPT%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>computergroup_name</key>
				<string>%GROUP_NAME%</string>
				<key>computergroup_template</key>
				<string>%GROUP_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>patch_softwaretitle</key>
				<string>Microsoft Edge</string>
				<key>patch_name</key>
				<string>Update %NAME%</string>
				<key>patch_template</key>
				<string>%PATCH_TEMPLATE%</string>
				<key>patch_icon_policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>replace_patch</key>
				<bool>True</bool>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPatchUploader</string>
		</dict>
		
	</array>
</dict>
</plist>
